def @main(%input_1:0: Tensor[(8, 224, 224, 3), float32]) -> Tensor[(8, 1000), float16] {
  %0 = cast(%input_1:0, dtype="float16") /* ty=Tensor[(8, 224, 224, 3), float16] */;
  %1 = transpose(%0, axes=[0, 3, 1, 2]) /* ty=Tensor[(8, 3, 224, 224), float16] */;
  %2 = nn.pad(%1, meta[relay.Constant][0] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 1], [0, 1]]) /* ty=Tensor[(8, 3, 225, 225), float16] */;
  %3 = layout_transform(%2, src_layout="NCHW", dst_layout="NHWC") /* ty=Tensor[(8, 225, 225, 3), float16] */;
  %4 = @tvmgen_default_cutlass_main_0(%3, meta[relay.Constant][1] /* ty=Tensor[(24, 3, 3, 3), float16] */, meta[relay.Constant][2] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %5 = nn.pad(%4, meta[relay.Constant][3] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 114, 114, 24), float16] */;
  %6 = @tvmgen_default_cutlass_main_3(%5, meta[relay.Constant][4] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][5] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %7 = add(%6, %4) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %8 = nn.pad(%7, meta[relay.Constant][6] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 114, 114, 24), float16] */;
  %9 = @tvmgen_default_cutlass_main_6(%8, meta[relay.Constant][7] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][8] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %10 = add(%9, %7) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %11 = nn.pad(%10, meta[relay.Constant][9] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 114, 114, 24), float16] */;
  %12 = @tvmgen_default_cutlass_main_9(%11, meta[relay.Constant][10] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][11] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %13 = add(%12, %10) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %14 = nn.pad(%13, meta[relay.Constant][12] /* ty=float16 */, pad_width=[[0, 0], [0, 1], [0, 1], [0, 0]]) /* ty=Tensor[(8, 113, 113, 24), float16] */;
  %15 = @tvmgen_default_cutlass_main_12(%14, meta[relay.Constant][13] /* ty=Tensor[(96, 3, 3, 24), float16] */, meta[relay.Constant][14] /* ty=Tensor[(1, 1, 1, 96), float16] */) /* ty=Tensor[(8, 56, 56, 96), float16] */;
  %16 = nn.pad(%15, meta[relay.Constant][15] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 56, 56, 96), float16] */;
  %17 = @tvmgen_default_cutlass_main_15(%16, meta[relay.Constant][16] /* ty=Tensor[(48, 1, 1, 96), float16] */, meta[relay.Constant][17] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %18 = nn.pad(%17, meta[relay.Constant][18] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 58, 58, 48), float16] */;
  %19 = @tvmgen_default_cutlass_main_18(%18, meta[relay.Constant][19] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][20] /* ty=Tensor[(192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %20 = nn.pad(%19, meta[relay.Constant][21] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %21 = @tvmgen_default_cutlass_main_21(%20, meta[relay.Constant][22] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][23] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %22 = add(%21, %17) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %23 = nn.pad(%22, meta[relay.Constant][24] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 58, 58, 48), float16] */;
  %24 = @tvmgen_default_cutlass_main_24(%23, meta[relay.Constant][25] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][26] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %25 = nn.pad(%24, meta[relay.Constant][27] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %26 = @tvmgen_default_cutlass_main_27(%25, meta[relay.Constant][28] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][29] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %27 = add(%26, %22) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %28 = nn.pad(%27, meta[relay.Constant][30] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 58, 58, 48), float16] */;
  %29 = @tvmgen_default_cutlass_main_30(%28, meta[relay.Constant][31] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][32] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %30 = nn.pad(%29, meta[relay.Constant][33] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %31 = @tvmgen_default_cutlass_main_33(%30, meta[relay.Constant][34] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][35] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %32 = add(%31, %27) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %33 = nn.pad(%32, meta[relay.Constant][36] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 58, 58, 48), float16] */;
  %34 = @tvmgen_default_cutlass_main_36(%33, meta[relay.Constant][37] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][38] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %35 = nn.pad(%34, meta[relay.Constant][39] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %36 = @tvmgen_default_cutlass_main_39(%35, meta[relay.Constant][40] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][41] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %37 = add(%36, %32) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %38 = nn.pad(%37, meta[relay.Constant][42] /* ty=float16 */, pad_width=[[0, 0], [0, 1], [0, 1], [0, 0]]) /* ty=Tensor[(8, 57, 57, 48), float16] */;
  %39 = @tvmgen_default_cutlass_main_42(%38, meta[relay.Constant][43] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][44] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 28, 28, 192), float16] */;
  %40 = nn.pad(%39, meta[relay.Constant][45] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 192), float16] */;
  %41 = @tvmgen_default_cutlass_main_45(%40, meta[relay.Constant][46] /* ty=Tensor[(80, 1, 1, 192), float16] */, meta[relay.Constant][47] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %42 = nn.pad(%41, meta[relay.Constant][48] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 30, 30, 80), float16] */;
  %43 = @tvmgen_default_cutlass_main_48(%42, meta[relay.Constant][49] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][50] /* ty=Tensor[(320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %44 = nn.pad(%43, meta[relay.Constant][51] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %45 = @tvmgen_default_cutlass_main_51(%44, meta[relay.Constant][52] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][53] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %46 = add(%45, %41) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %47 = nn.pad(%46, meta[relay.Constant][54] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 30, 30, 80), float16] */;
  %48 = @tvmgen_default_cutlass_main_54(%47, meta[relay.Constant][55] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][56] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %49 = nn.pad(%48, meta[relay.Constant][57] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %50 = @tvmgen_default_cutlass_main_57(%49, meta[relay.Constant][58] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][59] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %51 = add(%50, %46) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %52 = nn.pad(%51, meta[relay.Constant][60] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 30, 30, 80), float16] */;
  %53 = @tvmgen_default_cutlass_main_60(%52, meta[relay.Constant][61] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][62] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %54 = nn.pad(%53, meta[relay.Constant][63] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %55 = @tvmgen_default_cutlass_main_63(%54, meta[relay.Constant][64] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][65] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %56 = add(%55, %51) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %57 = nn.pad(%56, meta[relay.Constant][66] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 30, 30, 80), float16] */;
  %58 = @tvmgen_default_cutlass_main_66(%57, meta[relay.Constant][67] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][68] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %59 = nn.pad(%58, meta[relay.Constant][69] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %60 = @tvmgen_default_cutlass_main_69(%59, meta[relay.Constant][70] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][71] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %61 = add(%60, %56) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %62 = nn.pad(%61, meta[relay.Constant][72] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %63 = @tvmgen_default_cutlass_main_72(%62, meta[relay.Constant][73] /* ty=Tensor[(320, 1, 1, 80), float16] */, meta[relay.Constant][74] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %64 = nn.pad(%63, meta[relay.Constant][75] /* ty=float16 */, pad_width=[[0, 0], [0, 1], [0, 1], [0, 0]]) /* ty=Tensor[(8, 29, 29, 320), float16] */;
  %65 = layout_transform(meta[relay.Constant][76] /* ty=Tensor[(320, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 320, 1), float16] */;
  %66 = nn.conv2d(%64, %65, strides=[2, 2], padding=[0, 0, 0, 0], groups=320, channels=320, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %67 = add(%66, meta[relay.Constant][77] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %68 = sigmoid(%67) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %69 = multiply(%67, %68) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %70 = cast(%69, dtype="float32") /* ty=Tensor[(8, 14, 14, 320), float32] */;
  %71 = mean(%70, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 320), float32] */;
  %72 = cast(%71, dtype="float16") /* ty=Tensor[(8, 1, 1, 320), float16] */;
  %73 = @tvmgen_default_cutlass_main_75(%72, meta[relay.Constant][78] /* ty=Tensor[(20, 1, 1, 320), float16] */, meta[relay.Constant][79] /* ty=Tensor[(1, 1, 1, 20), float16] */) /* ty=Tensor[(8, 1, 1, 20), float16] */;
  %74 = @tvmgen_default_cutlass_main_78(%73, meta[relay.Constant][80] /* ty=Tensor[(320, 1, 1, 20), float16] */, meta[relay.Constant][81] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 1, 1, 320), float16] */;
  %75 = multiply(%74, %69) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %76 = nn.pad(%75, meta[relay.Constant][82] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %77 = @tvmgen_default_cutlass_main_81(%76, meta[relay.Constant][83] /* ty=Tensor[(160, 1, 1, 320), float16] */, meta[relay.Constant][84] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %78 = nn.pad(%77, meta[relay.Constant][85] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %79 = @tvmgen_default_cutlass_main_84(%78, meta[relay.Constant][86] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][87] /* ty=Tensor[(640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %80 = nn.pad(%79, meta[relay.Constant][88] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %81 = layout_transform(meta[relay.Constant][89] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %82 = nn.conv2d(%80, %81, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %83 = add(%82, meta[relay.Constant][90] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %84 = sigmoid(%83) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %85 = multiply(%83, %84) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %86 = cast(%85, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %87 = mean(%86, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %88 = cast(%87, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %89 = @tvmgen_default_cutlass_main_87(%88, meta[relay.Constant][91] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][92] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %90 = @tvmgen_default_cutlass_main_90(%89, meta[relay.Constant][93] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][94] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %91 = multiply(%90, %85) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %92 = nn.pad(%91, meta[relay.Constant][95] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %93 = @tvmgen_default_cutlass_main_93(%92, meta[relay.Constant][96] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][97] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %94 = add(%93, %77) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %95 = nn.pad(%94, meta[relay.Constant][98] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %96 = @tvmgen_default_cutlass_main_96(%95, meta[relay.Constant][99] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][100] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %97 = nn.pad(%96, meta[relay.Constant][101] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %98 = layout_transform(meta[relay.Constant][102] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %99 = nn.conv2d(%97, %98, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %100 = add(%99, meta[relay.Constant][103] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %101 = sigmoid(%100) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %102 = multiply(%100, %101) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %103 = cast(%102, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %104 = mean(%103, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %105 = cast(%104, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %106 = @tvmgen_default_cutlass_main_99(%105, meta[relay.Constant][104] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][105] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %107 = @tvmgen_default_cutlass_main_102(%106, meta[relay.Constant][106] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][107] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %108 = multiply(%107, %102) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %109 = nn.pad(%108, meta[relay.Constant][108] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %110 = @tvmgen_default_cutlass_main_105(%109, meta[relay.Constant][109] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][110] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %111 = add(%110, %94) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %112 = nn.pad(%111, meta[relay.Constant][111] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %113 = @tvmgen_default_cutlass_main_108(%112, meta[relay.Constant][112] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][113] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %114 = nn.pad(%113, meta[relay.Constant][114] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %115 = layout_transform(meta[relay.Constant][115] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %116 = nn.conv2d(%114, %115, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %117 = add(%116, meta[relay.Constant][116] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %118 = sigmoid(%117) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %119 = multiply(%117, %118) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %120 = cast(%119, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %121 = mean(%120, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %122 = cast(%121, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %123 = @tvmgen_default_cutlass_main_111(%122, meta[relay.Constant][117] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][118] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %124 = @tvmgen_default_cutlass_main_114(%123, meta[relay.Constant][119] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][120] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %125 = multiply(%124, %119) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %126 = nn.pad(%125, meta[relay.Constant][121] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %127 = @tvmgen_default_cutlass_main_117(%126, meta[relay.Constant][122] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][123] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %128 = add(%127, %111) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %129 = nn.pad(%128, meta[relay.Constant][124] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %130 = @tvmgen_default_cutlass_main_120(%129, meta[relay.Constant][125] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][126] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %131 = nn.pad(%130, meta[relay.Constant][127] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %132 = layout_transform(meta[relay.Constant][128] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %133 = nn.conv2d(%131, %132, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %134 = add(%133, meta[relay.Constant][129] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %135 = sigmoid(%134) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %136 = multiply(%134, %135) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %137 = cast(%136, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %138 = mean(%137, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %139 = cast(%138, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %140 = @tvmgen_default_cutlass_main_123(%139, meta[relay.Constant][130] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][131] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %141 = @tvmgen_default_cutlass_main_126(%140, meta[relay.Constant][132] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][133] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %142 = multiply(%141, %136) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %143 = nn.pad(%142, meta[relay.Constant][134] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %144 = @tvmgen_default_cutlass_main_129(%143, meta[relay.Constant][135] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][136] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %145 = add(%144, %128) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %146 = nn.pad(%145, meta[relay.Constant][137] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %147 = @tvmgen_default_cutlass_main_132(%146, meta[relay.Constant][138] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][139] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %148 = nn.pad(%147, meta[relay.Constant][140] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %149 = layout_transform(meta[relay.Constant][141] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %150 = nn.conv2d(%148, %149, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %151 = add(%150, meta[relay.Constant][142] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %152 = sigmoid(%151) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %153 = multiply(%151, %152) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %154 = cast(%153, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %155 = mean(%154, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %156 = cast(%155, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %157 = @tvmgen_default_cutlass_main_135(%156, meta[relay.Constant][143] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][144] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %158 = @tvmgen_default_cutlass_main_138(%157, meta[relay.Constant][145] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][146] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %159 = multiply(%158, %153) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %160 = nn.pad(%159, meta[relay.Constant][147] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %161 = @tvmgen_default_cutlass_main_141(%160, meta[relay.Constant][148] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][149] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %162 = add(%161, %145) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %163 = nn.pad(%162, meta[relay.Constant][150] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %164 = @tvmgen_default_cutlass_main_144(%163, meta[relay.Constant][151] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][152] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %165 = nn.pad(%164, meta[relay.Constant][153] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 640), float16] */;
  %166 = layout_transform(meta[relay.Constant][154] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %167 = nn.conv2d(%165, %166, padding=[0, 0, 0, 0], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %168 = add(%167, meta[relay.Constant][155] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %169 = sigmoid(%168) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %170 = multiply(%168, %169) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %171 = cast(%170, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %172 = mean(%171, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %173 = cast(%172, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %174 = @tvmgen_default_cutlass_main_147(%173, meta[relay.Constant][156] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][157] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %175 = @tvmgen_default_cutlass_main_150(%174, meta[relay.Constant][158] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][159] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %176 = multiply(%175, %170) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %177 = nn.pad(%176, meta[relay.Constant][160] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %178 = @tvmgen_default_cutlass_main_153(%177, meta[relay.Constant][161] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][162] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %179 = add(%178, %162) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %180 = nn.pad(%179, meta[relay.Constant][163] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %181 = @tvmgen_default_cutlass_main_156(%180, meta[relay.Constant][164] /* ty=Tensor[(960, 1, 1, 160), float16] */, meta[relay.Constant][165] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %182 = nn.pad(%181, meta[relay.Constant][166] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 960), float16] */;
  %183 = layout_transform(meta[relay.Constant][167] /* ty=Tensor[(960, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 960, 1), float16] */;
  %184 = nn.conv2d(%182, %183, padding=[0, 0, 0, 0], groups=960, channels=960, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %185 = add(%184, meta[relay.Constant][168] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %186 = sigmoid(%185) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %187 = multiply(%185, %186) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %188 = cast(%187, dtype="float32") /* ty=Tensor[(8, 14, 14, 960), float32] */;
  %189 = mean(%188, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 960), float32] */;
  %190 = cast(%189, dtype="float16") /* ty=Tensor[(8, 1, 1, 960), float16] */;
  %191 = @tvmgen_default_cutlass_main_159(%190, meta[relay.Constant][169] /* ty=Tensor[(40, 1, 1, 960), float16] */, meta[relay.Constant][170] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %192 = @tvmgen_default_cutlass_main_162(%191, meta[relay.Constant][171] /* ty=Tensor[(960, 1, 1, 40), float16] */, meta[relay.Constant][172] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 1, 1, 960), float16] */;
  %193 = multiply(%192, %187) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %194 = nn.pad(%193, meta[relay.Constant][173] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %195 = @tvmgen_default_cutlass_main_165(%194, meta[relay.Constant][174] /* ty=Tensor[(176, 1, 1, 960), float16] */, meta[relay.Constant][175] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %196 = nn.pad(%195, meta[relay.Constant][176] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %197 = @tvmgen_default_cutlass_main_168(%196, meta[relay.Constant][177] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][178] /* ty=Tensor[(1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %198 = nn.pad(%197, meta[relay.Constant][179] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %199 = layout_transform(meta[relay.Constant][180] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %200 = nn.conv2d(%198, %199, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %201 = add(%200, meta[relay.Constant][181] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %202 = sigmoid(%201) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %203 = multiply(%201, %202) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %204 = cast(%203, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %205 = mean(%204, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %206 = cast(%205, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %207 = @tvmgen_default_cutlass_main_171(%206, meta[relay.Constant][182] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][183] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %208 = @tvmgen_default_cutlass_main_174(%207, meta[relay.Constant][184] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][185] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %209 = multiply(%208, %203) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %210 = nn.pad(%209, meta[relay.Constant][186] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %211 = @tvmgen_default_cutlass_main_177(%210, meta[relay.Constant][187] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][188] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %212 = add(%211, %195) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %213 = nn.pad(%212, meta[relay.Constant][189] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %214 = @tvmgen_default_cutlass_main_180(%213, meta[relay.Constant][190] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][191] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %215 = nn.pad(%214, meta[relay.Constant][192] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %216 = layout_transform(meta[relay.Constant][193] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %217 = nn.conv2d(%215, %216, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %218 = add(%217, meta[relay.Constant][194] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %219 = sigmoid(%218) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %220 = multiply(%218, %219) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %221 = cast(%220, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %222 = mean(%221, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %223 = cast(%222, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %224 = @tvmgen_default_cutlass_main_183(%223, meta[relay.Constant][195] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][196] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %225 = @tvmgen_default_cutlass_main_186(%224, meta[relay.Constant][197] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][198] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %226 = multiply(%225, %220) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %227 = nn.pad(%226, meta[relay.Constant][199] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %228 = @tvmgen_default_cutlass_main_189(%227, meta[relay.Constant][200] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][201] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %229 = add(%228, %212) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %230 = nn.pad(%229, meta[relay.Constant][202] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %231 = @tvmgen_default_cutlass_main_192(%230, meta[relay.Constant][203] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][204] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %232 = nn.pad(%231, meta[relay.Constant][205] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %233 = layout_transform(meta[relay.Constant][206] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %234 = nn.conv2d(%232, %233, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %235 = add(%234, meta[relay.Constant][207] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %236 = sigmoid(%235) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %237 = multiply(%235, %236) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %238 = cast(%237, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %239 = mean(%238, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %240 = cast(%239, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %241 = @tvmgen_default_cutlass_main_195(%240, meta[relay.Constant][208] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][209] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %242 = @tvmgen_default_cutlass_main_198(%241, meta[relay.Constant][210] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][211] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %243 = multiply(%242, %237) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %244 = nn.pad(%243, meta[relay.Constant][212] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %245 = @tvmgen_default_cutlass_main_201(%244, meta[relay.Constant][213] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][214] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %246 = add(%245, %229) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %247 = nn.pad(%246, meta[relay.Constant][215] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %248 = @tvmgen_default_cutlass_main_204(%247, meta[relay.Constant][216] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][217] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %249 = nn.pad(%248, meta[relay.Constant][218] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %250 = layout_transform(meta[relay.Constant][219] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %251 = nn.conv2d(%249, %250, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %252 = add(%251, meta[relay.Constant][220] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %253 = sigmoid(%252) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %254 = multiply(%252, %253) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %255 = cast(%254, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %256 = mean(%255, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %257 = cast(%256, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %258 = @tvmgen_default_cutlass_main_207(%257, meta[relay.Constant][221] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][222] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %259 = @tvmgen_default_cutlass_main_210(%258, meta[relay.Constant][223] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][224] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %260 = multiply(%259, %254) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %261 = nn.pad(%260, meta[relay.Constant][225] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %262 = @tvmgen_default_cutlass_main_213(%261, meta[relay.Constant][226] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][227] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %263 = add(%262, %246) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %264 = nn.pad(%263, meta[relay.Constant][228] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %265 = @tvmgen_default_cutlass_main_216(%264, meta[relay.Constant][229] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][230] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %266 = nn.pad(%265, meta[relay.Constant][231] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %267 = layout_transform(meta[relay.Constant][232] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %268 = nn.conv2d(%266, %267, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %269 = add(%268, meta[relay.Constant][233] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %270 = sigmoid(%269) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %271 = multiply(%269, %270) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %272 = cast(%271, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %273 = mean(%272, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %274 = cast(%273, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %275 = @tvmgen_default_cutlass_main_219(%274, meta[relay.Constant][234] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][235] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %276 = @tvmgen_default_cutlass_main_222(%275, meta[relay.Constant][236] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][237] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %277 = multiply(%276, %271) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %278 = nn.pad(%277, meta[relay.Constant][238] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %279 = @tvmgen_default_cutlass_main_225(%278, meta[relay.Constant][239] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][240] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %280 = add(%279, %263) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %281 = nn.pad(%280, meta[relay.Constant][241] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %282 = @tvmgen_default_cutlass_main_228(%281, meta[relay.Constant][242] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][243] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %283 = nn.pad(%282, meta[relay.Constant][244] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %284 = layout_transform(meta[relay.Constant][245] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %285 = nn.conv2d(%283, %284, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %286 = add(%285, meta[relay.Constant][246] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %287 = sigmoid(%286) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %288 = multiply(%286, %287) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %289 = cast(%288, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %290 = mean(%289, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %291 = cast(%290, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %292 = @tvmgen_default_cutlass_main_231(%291, meta[relay.Constant][247] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][248] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %293 = @tvmgen_default_cutlass_main_234(%292, meta[relay.Constant][249] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][250] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %294 = multiply(%293, %288) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %295 = nn.pad(%294, meta[relay.Constant][251] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %296 = @tvmgen_default_cutlass_main_237(%295, meta[relay.Constant][252] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][253] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %297 = add(%296, %280) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %298 = nn.pad(%297, meta[relay.Constant][254] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %299 = @tvmgen_default_cutlass_main_240(%298, meta[relay.Constant][255] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][256] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %300 = nn.pad(%299, meta[relay.Constant][257] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %301 = layout_transform(meta[relay.Constant][258] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %302 = nn.conv2d(%300, %301, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %303 = add(%302, meta[relay.Constant][259] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %304 = sigmoid(%303) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %305 = multiply(%303, %304) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %306 = cast(%305, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %307 = mean(%306, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %308 = cast(%307, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %309 = @tvmgen_default_cutlass_main_243(%308, meta[relay.Constant][260] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][261] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %310 = @tvmgen_default_cutlass_main_246(%309, meta[relay.Constant][262] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][263] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %311 = multiply(%310, %305) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %312 = nn.pad(%311, meta[relay.Constant][264] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %313 = @tvmgen_default_cutlass_main_249(%312, meta[relay.Constant][265] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][266] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %314 = add(%313, %297) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %315 = nn.pad(%314, meta[relay.Constant][267] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %316 = @tvmgen_default_cutlass_main_252(%315, meta[relay.Constant][268] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][269] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %317 = nn.pad(%316, meta[relay.Constant][270] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %318 = layout_transform(meta[relay.Constant][271] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %319 = nn.conv2d(%317, %318, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %320 = add(%319, meta[relay.Constant][272] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %321 = sigmoid(%320) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %322 = multiply(%320, %321) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %323 = cast(%322, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %324 = mean(%323, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %325 = cast(%324, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %326 = @tvmgen_default_cutlass_main_255(%325, meta[relay.Constant][273] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][274] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %327 = @tvmgen_default_cutlass_main_258(%326, meta[relay.Constant][275] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][276] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %328 = multiply(%327, %322) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %329 = nn.pad(%328, meta[relay.Constant][277] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %330 = @tvmgen_default_cutlass_main_261(%329, meta[relay.Constant][278] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][279] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %331 = add(%330, %314) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %332 = nn.pad(%331, meta[relay.Constant][280] /* ty=float16 */, pad_width=[[0, 0], [0, 0], [0, 0], [0, 0]]) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %333 = @tvmgen_default_cutlass_main_264(%332, meta[relay.Constant][281] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][282] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %334 = nn.pad(%333, meta[relay.Constant][283] /* ty=float16 */, pad_width=[[0, 0], [1, 1], [1, 1], [0, 0]]) /* ty=Tensor[(8, 16, 16, 1056), float16] */;
  %335 = layout_transform(meta[relay.Constant][284] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %336 = nn.conv2d(%334, %335, padding=[0, 0, 0, 0], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %337 = add(%336, meta[relay.Constant][285] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %338 = sigmoid(%337) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %339 = multiply(%337, %338) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %340 = cast(%339, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
