def @main(%input_1:0: Tensor[(8, 224, 224, 3), float32]) -> Tensor[(8, 1000), float16] {
  %0 = cast(%input_1:0, dtype="float16") /* ty=Tensor[(8, 224, 224, 3), float16] */;
  %1 = @tvmgen_default_cutlass_main_0(%0, meta[relay.Constant][0] /* ty=Tensor[(24, 3, 3, 3), float16] */, meta[relay.Constant][1] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %2 = @tvmgen_default_cutlass_main_3(%1, meta[relay.Constant][2] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][3] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %3 = @tvmgen_default_cutlass_main_7(%2, meta[relay.Constant][4] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][5] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %4 = @tvmgen_default_cutlass_main_11(%3, meta[relay.Constant][6] /* ty=Tensor[(24, 3, 3, 24), float16] */, meta[relay.Constant][7] /* ty=Tensor[(1, 1, 1, 24), float16] */) /* ty=Tensor[(8, 112, 112, 24), float16] */;
  %5 = @tvmgen_default_cutlass_main_15(%4, meta[relay.Constant][8] /* ty=Tensor[(96, 3, 3, 24), float16] */, meta[relay.Constant][9] /* ty=Tensor[(1, 1, 1, 96), float16] */) /* ty=Tensor[(8, 56, 56, 96), float16] */;
  %6 = @tvmgen_default_cutlass_main_18(%5, meta[relay.Constant][10] /* ty=Tensor[(48, 1, 1, 96), float16] */, meta[relay.Constant][11] /* ty=Tensor[(1, 1, 1, 48), float16] */) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %7 = @tvmgen_default_cutlass_main_21(%6, meta[relay.Constant][12] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][13] /* ty=Tensor[(192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %8 = @tvmgen_default_cutlass_main_24(%7, meta[relay.Constant][14] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][15] /* ty=Tensor[(1, 1, 1, 48), float16] */, %6) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %9 = @tvmgen_default_cutlass_main_28(%8, meta[relay.Constant][16] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][17] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %10 = @tvmgen_default_cutlass_main_31(%9, meta[relay.Constant][18] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][19] /* ty=Tensor[(1, 1, 1, 48), float16] */, %8) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %11 = @tvmgen_default_cutlass_main_35(%10, meta[relay.Constant][20] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][21] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %12 = @tvmgen_default_cutlass_main_38(%11, meta[relay.Constant][22] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][23] /* ty=Tensor[(1, 1, 1, 48), float16] */, %10) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %13 = @tvmgen_default_cutlass_main_42(%12, meta[relay.Constant][24] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][25] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 56, 56, 192), float16] */;
  %14 = @tvmgen_default_cutlass_main_45(%13, meta[relay.Constant][26] /* ty=Tensor[(48, 1, 1, 192), float16] */, meta[relay.Constant][27] /* ty=Tensor[(1, 1, 1, 48), float16] */, %12) /* ty=Tensor[(8, 56, 56, 48), float16] */;
  %15 = @tvmgen_default_cutlass_main_49(%14, meta[relay.Constant][28] /* ty=Tensor[(192, 3, 3, 48), float16] */, meta[relay.Constant][29] /* ty=Tensor[(1, 1, 1, 192), float16] */) /* ty=Tensor[(8, 28, 28, 192), float16] */;
  %16 = @tvmgen_default_cutlass_main_52(%15, meta[relay.Constant][30] /* ty=Tensor[(80, 1, 1, 192), float16] */, meta[relay.Constant][31] /* ty=Tensor[(1, 1, 1, 80), float16] */) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %17 = @tvmgen_default_cutlass_main_55(%16, meta[relay.Constant][32] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][33] /* ty=Tensor[(320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %18 = @tvmgen_default_cutlass_main_58(%17, meta[relay.Constant][34] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][35] /* ty=Tensor[(1, 1, 1, 80), float16] */, %16) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %19 = @tvmgen_default_cutlass_main_62(%18, meta[relay.Constant][36] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][37] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %20 = @tvmgen_default_cutlass_main_65(%19, meta[relay.Constant][38] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][39] /* ty=Tensor[(1, 1, 1, 80), float16] */, %18) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %21 = @tvmgen_default_cutlass_main_69(%20, meta[relay.Constant][40] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][41] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %22 = @tvmgen_default_cutlass_main_72(%21, meta[relay.Constant][42] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][43] /* ty=Tensor[(1, 1, 1, 80), float16] */, %20) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %23 = @tvmgen_default_cutlass_main_76(%22, meta[relay.Constant][44] /* ty=Tensor[(320, 3, 3, 80), float16] */, meta[relay.Constant][45] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %24 = @tvmgen_default_cutlass_main_79(%23, meta[relay.Constant][46] /* ty=Tensor[(80, 1, 1, 320), float16] */, meta[relay.Constant][47] /* ty=Tensor[(1, 1, 1, 80), float16] */, %22) /* ty=Tensor[(8, 28, 28, 80), float16] */;
  %25 = @tvmgen_default_cutlass_main_83(%24, meta[relay.Constant][48] /* ty=Tensor[(320, 1, 1, 80), float16] */, meta[relay.Constant][49] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 28, 28, 320), float16] */;
  %26 = layout_transform(meta[relay.Constant][50] /* ty=Tensor[(320, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 320, 1), float16] */;
  %27 = nn.conv2d(%25, %26, strides=[2, 2], padding=[0, 0, 1, 1], groups=320, channels=320, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %28 = add(%27, meta[relay.Constant][51] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %29 = sigmoid(%28) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %30 = multiply(%28, %29) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %31 = cast(%30, dtype="float32") /* ty=Tensor[(8, 14, 14, 320), float32] */;
  %32 = mean(%31, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 320), float32] */;
  %33 = cast(%32, dtype="float16") /* ty=Tensor[(8, 1, 1, 320), float16] */;
  %34 = @tvmgen_default_cutlass_main_86(%33, meta[relay.Constant][52] /* ty=Tensor[(20, 1, 1, 320), float16] */, meta[relay.Constant][53] /* ty=Tensor[(1, 1, 1, 20), float16] */) /* ty=Tensor[(8, 1, 1, 20), float16] */;
  %35 = @tvmgen_default_cutlass_main_89(%34, meta[relay.Constant][54] /* ty=Tensor[(320, 1, 1, 20), float16] */, meta[relay.Constant][55] /* ty=Tensor[(1, 1, 1, 320), float16] */) /* ty=Tensor[(8, 1, 1, 320), float16] */;
  %36 = multiply(%35, %30) /* ty=Tensor[(8, 14, 14, 320), float16] */;
  %37 = @tvmgen_default_cutlass_main_92(%36, meta[relay.Constant][56] /* ty=Tensor[(160, 1, 1, 320), float16] */, meta[relay.Constant][57] /* ty=Tensor[(1, 1, 1, 160), float16] */) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %38 = @tvmgen_default_cutlass_main_95(%37, meta[relay.Constant][58] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][59] /* ty=Tensor[(640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %39 = layout_transform(meta[relay.Constant][60] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %40 = nn.conv2d(%38, %39, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %41 = add(%40, meta[relay.Constant][61] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %42 = sigmoid(%41) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %43 = multiply(%41, %42) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %44 = cast(%43, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %45 = mean(%44, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %46 = cast(%45, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %47 = @tvmgen_default_cutlass_main_98(%46, meta[relay.Constant][62] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][63] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %48 = @tvmgen_default_cutlass_main_101(%47, meta[relay.Constant][64] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][65] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %49 = multiply(%48, %43) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %50 = @tvmgen_default_cutlass_main_104(%49, meta[relay.Constant][66] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][67] /* ty=Tensor[(1, 1, 1, 160), float16] */, %37) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %51 = @tvmgen_default_cutlass_main_108(%50, meta[relay.Constant][68] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][69] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %52 = layout_transform(meta[relay.Constant][70] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %53 = nn.conv2d(%51, %52, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %54 = add(%53, meta[relay.Constant][71] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %55 = sigmoid(%54) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %56 = multiply(%54, %55) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %57 = cast(%56, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %58 = mean(%57, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %59 = cast(%58, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %60 = @tvmgen_default_cutlass_main_111(%59, meta[relay.Constant][72] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][73] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %61 = @tvmgen_default_cutlass_main_114(%60, meta[relay.Constant][74] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][75] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %62 = multiply(%61, %56) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %63 = @tvmgen_default_cutlass_main_117(%62, meta[relay.Constant][76] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][77] /* ty=Tensor[(1, 1, 1, 160), float16] */, %50) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %64 = @tvmgen_default_cutlass_main_121(%63, meta[relay.Constant][78] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][79] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %65 = layout_transform(meta[relay.Constant][80] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %66 = nn.conv2d(%64, %65, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %67 = add(%66, meta[relay.Constant][81] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %68 = sigmoid(%67) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %69 = multiply(%67, %68) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %70 = cast(%69, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %71 = mean(%70, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %72 = cast(%71, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %73 = @tvmgen_default_cutlass_main_124(%72, meta[relay.Constant][82] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][83] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %74 = @tvmgen_default_cutlass_main_127(%73, meta[relay.Constant][84] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][85] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %75 = multiply(%74, %69) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %76 = @tvmgen_default_cutlass_main_130(%75, meta[relay.Constant][86] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][87] /* ty=Tensor[(1, 1, 1, 160), float16] */, %63) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %77 = @tvmgen_default_cutlass_main_134(%76, meta[relay.Constant][88] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][89] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %78 = layout_transform(meta[relay.Constant][90] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %79 = nn.conv2d(%77, %78, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %80 = add(%79, meta[relay.Constant][91] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %81 = sigmoid(%80) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %82 = multiply(%80, %81) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %83 = cast(%82, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %84 = mean(%83, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %85 = cast(%84, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %86 = @tvmgen_default_cutlass_main_137(%85, meta[relay.Constant][92] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][93] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %87 = @tvmgen_default_cutlass_main_140(%86, meta[relay.Constant][94] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][95] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %88 = multiply(%87, %82) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %89 = @tvmgen_default_cutlass_main_143(%88, meta[relay.Constant][96] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][97] /* ty=Tensor[(1, 1, 1, 160), float16] */, %76) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %90 = @tvmgen_default_cutlass_main_147(%89, meta[relay.Constant][98] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][99] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %91 = layout_transform(meta[relay.Constant][100] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %92 = nn.conv2d(%90, %91, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %93 = add(%92, meta[relay.Constant][101] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %94 = sigmoid(%93) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %95 = multiply(%93, %94) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %96 = cast(%95, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %97 = mean(%96, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %98 = cast(%97, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %99 = @tvmgen_default_cutlass_main_150(%98, meta[relay.Constant][102] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][103] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %100 = @tvmgen_default_cutlass_main_153(%99, meta[relay.Constant][104] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][105] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %101 = multiply(%100, %95) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %102 = @tvmgen_default_cutlass_main_156(%101, meta[relay.Constant][106] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][107] /* ty=Tensor[(1, 1, 1, 160), float16] */, %89) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %103 = @tvmgen_default_cutlass_main_160(%102, meta[relay.Constant][108] /* ty=Tensor[(640, 1, 1, 160), float16] */, meta[relay.Constant][109] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %104 = layout_transform(meta[relay.Constant][110] /* ty=Tensor[(640, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 640, 1), float16] */;
  %105 = nn.conv2d(%103, %104, padding=[1, 1, 1, 1], groups=640, channels=640, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %106 = add(%105, meta[relay.Constant][111] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %107 = sigmoid(%106) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %108 = multiply(%106, %107) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %109 = cast(%108, dtype="float32") /* ty=Tensor[(8, 14, 14, 640), float32] */;
  %110 = mean(%109, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 640), float32] */;
  %111 = cast(%110, dtype="float16") /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %112 = @tvmgen_default_cutlass_main_163(%111, meta[relay.Constant][112] /* ty=Tensor[(40, 1, 1, 640), float16] */, meta[relay.Constant][113] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %113 = @tvmgen_default_cutlass_main_166(%112, meta[relay.Constant][114] /* ty=Tensor[(640, 1, 1, 40), float16] */, meta[relay.Constant][115] /* ty=Tensor[(1, 1, 1, 640), float16] */) /* ty=Tensor[(8, 1, 1, 640), float16] */;
  %114 = multiply(%113, %108) /* ty=Tensor[(8, 14, 14, 640), float16] */;
  %115 = @tvmgen_default_cutlass_main_169(%114, meta[relay.Constant][116] /* ty=Tensor[(160, 1, 1, 640), float16] */, meta[relay.Constant][117] /* ty=Tensor[(1, 1, 1, 160), float16] */, %102) /* ty=Tensor[(8, 14, 14, 160), float16] */;
  %116 = @tvmgen_default_cutlass_main_173(%115, meta[relay.Constant][118] /* ty=Tensor[(960, 1, 1, 160), float16] */, meta[relay.Constant][119] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %117 = layout_transform(meta[relay.Constant][120] /* ty=Tensor[(960, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 960, 1), float16] */;
  %118 = nn.conv2d(%116, %117, padding=[1, 1, 1, 1], groups=960, channels=960, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %119 = add(%118, meta[relay.Constant][121] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %120 = sigmoid(%119) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %121 = multiply(%119, %120) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %122 = cast(%121, dtype="float32") /* ty=Tensor[(8, 14, 14, 960), float32] */;
  %123 = mean(%122, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 960), float32] */;
  %124 = cast(%123, dtype="float16") /* ty=Tensor[(8, 1, 1, 960), float16] */;
  %125 = @tvmgen_default_cutlass_main_176(%124, meta[relay.Constant][122] /* ty=Tensor[(40, 1, 1, 960), float16] */, meta[relay.Constant][123] /* ty=Tensor[(1, 1, 1, 40), float16] */) /* ty=Tensor[(8, 1, 1, 40), float16] */;
  %126 = @tvmgen_default_cutlass_main_179(%125, meta[relay.Constant][124] /* ty=Tensor[(960, 1, 1, 40), float16] */, meta[relay.Constant][125] /* ty=Tensor[(1, 1, 1, 960), float16] */) /* ty=Tensor[(8, 1, 1, 960), float16] */;
  %127 = multiply(%126, %121) /* ty=Tensor[(8, 14, 14, 960), float16] */;
  %128 = @tvmgen_default_cutlass_main_182(%127, meta[relay.Constant][126] /* ty=Tensor[(176, 1, 1, 960), float16] */, meta[relay.Constant][127] /* ty=Tensor[(1, 1, 1, 176), float16] */) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %129 = @tvmgen_default_cutlass_main_185(%128, meta[relay.Constant][128] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][129] /* ty=Tensor[(1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %130 = layout_transform(meta[relay.Constant][130] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %131 = nn.conv2d(%129, %130, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %132 = add(%131, meta[relay.Constant][131] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %133 = sigmoid(%132) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %134 = multiply(%132, %133) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %135 = cast(%134, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %136 = mean(%135, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %137 = cast(%136, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %138 = @tvmgen_default_cutlass_main_188(%137, meta[relay.Constant][132] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][133] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %139 = @tvmgen_default_cutlass_main_191(%138, meta[relay.Constant][134] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][135] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %140 = multiply(%139, %134) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %141 = @tvmgen_default_cutlass_main_194(%140, meta[relay.Constant][136] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][137] /* ty=Tensor[(1, 1, 1, 176), float16] */, %128) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %142 = @tvmgen_default_cutlass_main_198(%141, meta[relay.Constant][138] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][139] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %143 = layout_transform(meta[relay.Constant][140] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %144 = nn.conv2d(%142, %143, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %145 = add(%144, meta[relay.Constant][141] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %146 = sigmoid(%145) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %147 = multiply(%145, %146) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %148 = cast(%147, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %149 = mean(%148, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %150 = cast(%149, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %151 = @tvmgen_default_cutlass_main_201(%150, meta[relay.Constant][142] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][143] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %152 = @tvmgen_default_cutlass_main_204(%151, meta[relay.Constant][144] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][145] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %153 = multiply(%152, %147) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %154 = @tvmgen_default_cutlass_main_207(%153, meta[relay.Constant][146] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][147] /* ty=Tensor[(1, 1, 1, 176), float16] */, %141) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %155 = @tvmgen_default_cutlass_main_211(%154, meta[relay.Constant][148] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][149] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %156 = layout_transform(meta[relay.Constant][150] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %157 = nn.conv2d(%155, %156, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %158 = add(%157, meta[relay.Constant][151] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %159 = sigmoid(%158) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %160 = multiply(%158, %159) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %161 = cast(%160, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %162 = mean(%161, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %163 = cast(%162, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %164 = @tvmgen_default_cutlass_main_214(%163, meta[relay.Constant][152] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][153] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %165 = @tvmgen_default_cutlass_main_217(%164, meta[relay.Constant][154] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][155] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %166 = multiply(%165, %160) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %167 = @tvmgen_default_cutlass_main_220(%166, meta[relay.Constant][156] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][157] /* ty=Tensor[(1, 1, 1, 176), float16] */, %154) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %168 = @tvmgen_default_cutlass_main_224(%167, meta[relay.Constant][158] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][159] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %169 = layout_transform(meta[relay.Constant][160] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %170 = nn.conv2d(%168, %169, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %171 = add(%170, meta[relay.Constant][161] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %172 = sigmoid(%171) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %173 = multiply(%171, %172) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %174 = cast(%173, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %175 = mean(%174, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %176 = cast(%175, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %177 = @tvmgen_default_cutlass_main_227(%176, meta[relay.Constant][162] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][163] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %178 = @tvmgen_default_cutlass_main_230(%177, meta[relay.Constant][164] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][165] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %179 = multiply(%178, %173) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %180 = @tvmgen_default_cutlass_main_233(%179, meta[relay.Constant][166] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][167] /* ty=Tensor[(1, 1, 1, 176), float16] */, %167) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %181 = @tvmgen_default_cutlass_main_237(%180, meta[relay.Constant][168] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][169] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %182 = layout_transform(meta[relay.Constant][170] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %183 = nn.conv2d(%181, %182, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %184 = add(%183, meta[relay.Constant][171] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %185 = sigmoid(%184) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %186 = multiply(%184, %185) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %187 = cast(%186, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %188 = mean(%187, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %189 = cast(%188, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %190 = @tvmgen_default_cutlass_main_240(%189, meta[relay.Constant][172] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][173] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %191 = @tvmgen_default_cutlass_main_243(%190, meta[relay.Constant][174] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][175] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %192 = multiply(%191, %186) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %193 = @tvmgen_default_cutlass_main_246(%192, meta[relay.Constant][176] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][177] /* ty=Tensor[(1, 1, 1, 176), float16] */, %180) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %194 = @tvmgen_default_cutlass_main_250(%193, meta[relay.Constant][178] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][179] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %195 = layout_transform(meta[relay.Constant][180] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %196 = nn.conv2d(%194, %195, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %197 = add(%196, meta[relay.Constant][181] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %198 = sigmoid(%197) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %199 = multiply(%197, %198) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %200 = cast(%199, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %201 = mean(%200, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %202 = cast(%201, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %203 = @tvmgen_default_cutlass_main_253(%202, meta[relay.Constant][182] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][183] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %204 = @tvmgen_default_cutlass_main_256(%203, meta[relay.Constant][184] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][185] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %205 = multiply(%204, %199) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %206 = @tvmgen_default_cutlass_main_259(%205, meta[relay.Constant][186] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][187] /* ty=Tensor[(1, 1, 1, 176), float16] */, %193) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %207 = @tvmgen_default_cutlass_main_263(%206, meta[relay.Constant][188] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][189] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %208 = layout_transform(meta[relay.Constant][190] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %209 = nn.conv2d(%207, %208, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %210 = add(%209, meta[relay.Constant][191] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %211 = sigmoid(%210) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %212 = multiply(%210, %211) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %213 = cast(%212, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %214 = mean(%213, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %215 = cast(%214, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %216 = @tvmgen_default_cutlass_main_266(%215, meta[relay.Constant][192] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][193] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %217 = @tvmgen_default_cutlass_main_269(%216, meta[relay.Constant][194] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][195] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %218 = multiply(%217, %212) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %219 = @tvmgen_default_cutlass_main_272(%218, meta[relay.Constant][196] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][197] /* ty=Tensor[(1, 1, 1, 176), float16] */, %206) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %220 = @tvmgen_default_cutlass_main_276(%219, meta[relay.Constant][198] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][199] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %221 = layout_transform(meta[relay.Constant][200] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %222 = nn.conv2d(%220, %221, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %223 = add(%222, meta[relay.Constant][201] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %224 = sigmoid(%223) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %225 = multiply(%223, %224) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %226 = cast(%225, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %227 = mean(%226, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %228 = cast(%227, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %229 = @tvmgen_default_cutlass_main_279(%228, meta[relay.Constant][202] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][203] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %230 = @tvmgen_default_cutlass_main_282(%229, meta[relay.Constant][204] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][205] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %231 = multiply(%230, %225) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %232 = @tvmgen_default_cutlass_main_285(%231, meta[relay.Constant][206] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][207] /* ty=Tensor[(1, 1, 1, 176), float16] */, %219) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %233 = @tvmgen_default_cutlass_main_289(%232, meta[relay.Constant][208] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][209] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %234 = layout_transform(meta[relay.Constant][210] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %235 = nn.conv2d(%233, %234, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %236 = add(%235, meta[relay.Constant][211] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %237 = sigmoid(%236) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %238 = multiply(%236, %237) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %239 = cast(%238, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %240 = mean(%239, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %241 = cast(%240, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %242 = @tvmgen_default_cutlass_main_292(%241, meta[relay.Constant][212] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][213] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %243 = @tvmgen_default_cutlass_main_295(%242, meta[relay.Constant][214] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][215] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %244 = multiply(%243, %238) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %245 = @tvmgen_default_cutlass_main_298(%244, meta[relay.Constant][216] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][217] /* ty=Tensor[(1, 1, 1, 176), float16] */, %232) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %246 = @tvmgen_default_cutlass_main_302(%245, meta[relay.Constant][218] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][219] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %247 = layout_transform(meta[relay.Constant][220] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %248 = nn.conv2d(%246, %247, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %249 = add(%248, meta[relay.Constant][221] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %250 = sigmoid(%249) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %251 = multiply(%249, %250) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %252 = cast(%251, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %253 = mean(%252, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %254 = cast(%253, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %255 = @tvmgen_default_cutlass_main_305(%254, meta[relay.Constant][222] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][223] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %256 = @tvmgen_default_cutlass_main_308(%255, meta[relay.Constant][224] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][225] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %257 = multiply(%256, %251) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %258 = @tvmgen_default_cutlass_main_311(%257, meta[relay.Constant][226] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][227] /* ty=Tensor[(1, 1, 1, 176), float16] */, %245) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %259 = @tvmgen_default_cutlass_main_315(%258, meta[relay.Constant][228] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][229] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %260 = layout_transform(meta[relay.Constant][230] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %261 = nn.conv2d(%259, %260, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %262 = add(%261, meta[relay.Constant][231] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %263 = sigmoid(%262) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %264 = multiply(%262, %263) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %265 = cast(%264, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %266 = mean(%265, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %267 = cast(%266, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %268 = @tvmgen_default_cutlass_main_318(%267, meta[relay.Constant][232] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][233] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %269 = @tvmgen_default_cutlass_main_321(%268, meta[relay.Constant][234] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][235] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %270 = multiply(%269, %264) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %271 = @tvmgen_default_cutlass_main_324(%270, meta[relay.Constant][236] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][237] /* ty=Tensor[(1, 1, 1, 176), float16] */, %258) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %272 = @tvmgen_default_cutlass_main_328(%271, meta[relay.Constant][238] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][239] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %273 = layout_transform(meta[relay.Constant][240] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %274 = nn.conv2d(%272, %273, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %275 = add(%274, meta[relay.Constant][241] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %276 = sigmoid(%275) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %277 = multiply(%275, %276) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %278 = cast(%277, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %279 = mean(%278, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %280 = cast(%279, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %281 = @tvmgen_default_cutlass_main_331(%280, meta[relay.Constant][242] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][243] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %282 = @tvmgen_default_cutlass_main_334(%281, meta[relay.Constant][244] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][245] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %283 = multiply(%282, %277) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %284 = @tvmgen_default_cutlass_main_337(%283, meta[relay.Constant][246] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][247] /* ty=Tensor[(1, 1, 1, 176), float16] */, %271) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %285 = @tvmgen_default_cutlass_main_341(%284, meta[relay.Constant][248] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][249] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %286 = layout_transform(meta[relay.Constant][250] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %287 = nn.conv2d(%285, %286, padding=[1, 1, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %288 = add(%287, meta[relay.Constant][251] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %289 = sigmoid(%288) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %290 = multiply(%288, %289) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %291 = cast(%290, dtype="float32") /* ty=Tensor[(8, 14, 14, 1056), float32] */;
  %292 = mean(%291, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %293 = cast(%292, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %294 = @tvmgen_default_cutlass_main_344(%293, meta[relay.Constant][252] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][253] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %295 = @tvmgen_default_cutlass_main_347(%294, meta[relay.Constant][254] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][255] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %296 = multiply(%295, %290) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %297 = @tvmgen_default_cutlass_main_350(%296, meta[relay.Constant][256] /* ty=Tensor[(176, 1, 1, 1056), float16] */, meta[relay.Constant][257] /* ty=Tensor[(1, 1, 1, 176), float16] */, %284) /* ty=Tensor[(8, 14, 14, 176), float16] */;
  %298 = @tvmgen_default_cutlass_main_354(%297, meta[relay.Constant][258] /* ty=Tensor[(1056, 1, 1, 176), float16] */, meta[relay.Constant][259] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 14, 14, 1056), float16] */;
  %299 = layout_transform(meta[relay.Constant][260] /* ty=Tensor[(1056, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1056, 1), float16] */;
  %300 = nn.conv2d(%298, %299, strides=[2, 2], padding=[0, 0, 1, 1], groups=1056, channels=1056, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 7, 7, 1056), float16] */;
  %301 = add(%300, meta[relay.Constant][261] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 7, 7, 1056), float16] */;
  %302 = sigmoid(%301) /* ty=Tensor[(8, 7, 7, 1056), float16] */;
  %303 = multiply(%301, %302) /* ty=Tensor[(8, 7, 7, 1056), float16] */;
  %304 = cast(%303, dtype="float32") /* ty=Tensor[(8, 7, 7, 1056), float32] */;
  %305 = mean(%304, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1056), float32] */;
  %306 = cast(%305, dtype="float16") /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %307 = @tvmgen_default_cutlass_main_357(%306, meta[relay.Constant][262] /* ty=Tensor[(44, 1, 1, 1056), float16] */, meta[relay.Constant][263] /* ty=Tensor[(1, 1, 1, 44), float16] */) /* ty=Tensor[(8, 1, 1, 44), float16] */;
  %308 = @tvmgen_default_cutlass_main_360(%307, meta[relay.Constant][264] /* ty=Tensor[(1056, 1, 1, 44), float16] */, meta[relay.Constant][265] /* ty=Tensor[(1, 1, 1, 1056), float16] */) /* ty=Tensor[(8, 1, 1, 1056), float16] */;
  %309 = multiply(%308, %303) /* ty=Tensor[(8, 7, 7, 1056), float16] */;
  %310 = @tvmgen_default_cutlass_main_363(%309, meta[relay.Constant][266] /* ty=Tensor[(304, 1, 1, 1056), float16] */, meta[relay.Constant][267] /* ty=Tensor[(1, 1, 1, 304), float16] */) /* ty=Tensor[(8, 7, 7, 304), float16] */;
  %311 = @tvmgen_default_cutlass_main_366(%310, meta[relay.Constant][268] /* ty=Tensor[(1824, 1, 1, 304), float16] */, meta[relay.Constant][269] /* ty=Tensor[(1824), float16] */) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %312 = layout_transform(meta[relay.Constant][270] /* ty=Tensor[(1824, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1824, 1), float16] */;
  %313 = nn.conv2d(%311, %312, padding=[1, 1, 1, 1], groups=1824, channels=1824, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %314 = add(%313, meta[relay.Constant][271] /* ty=Tensor[(1, 1, 1, 1824), float16] */) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %315 = sigmoid(%314) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %316 = multiply(%314, %315) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %317 = cast(%316, dtype="float32") /* ty=Tensor[(8, 7, 7, 1824), float32] */;
  %318 = mean(%317, axis=[1, 2], keepdims=True) /* ty=Tensor[(8, 1, 1, 1824), float32] */;
  %319 = cast(%318, dtype="float16") /* ty=Tensor[(8, 1, 1, 1824), float16] */;
  %320 = @tvmgen_default_cutlass_main_369(%319, meta[relay.Constant][272] /* ty=Tensor[(76, 1, 1, 1824), float16] */, meta[relay.Constant][273] /* ty=Tensor[(1, 1, 1, 76), float16] */) /* ty=Tensor[(8, 1, 1, 76), float16] */;
  %321 = @tvmgen_default_cutlass_main_372(%320, meta[relay.Constant][274] /* ty=Tensor[(1824, 1, 1, 76), float16] */, meta[relay.Constant][275] /* ty=Tensor[(1, 1, 1, 1824), float16] */) /* ty=Tensor[(8, 1, 1, 1824), float16] */;
  %322 = multiply(%321, %316) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %323 = @tvmgen_default_cutlass_main_375(%322, meta[relay.Constant][276] /* ty=Tensor[(304, 1, 1, 1824), float16] */, meta[relay.Constant][277] /* ty=Tensor[(1, 1, 1, 304), float16] */, %310) /* ty=Tensor[(8, 7, 7, 304), float16] */;
  %324 = @tvmgen_default_cutlass_main_379(%323, meta[relay.Constant][278] /* ty=Tensor[(1824, 1, 1, 304), float16] */, meta[relay.Constant][279] /* ty=Tensor[(1, 1, 1, 1824), float16] */) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %325 = layout_transform(meta[relay.Constant][280] /* ty=Tensor[(1824, 3, 3, 1), float16] */, src_layout="OHWI", dst_layout="HWOI") /* ty=Tensor[(3, 3, 1824, 1), float16] */;
  %326 = nn.conv2d(%324, %325, padding=[1, 1, 1, 1], groups=1824, channels=1824, kernel_size=[3, 3], data_layout="NHWC", kernel_layout="HWOI", out_dtype="float16") /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %327 = add(%326, meta[relay.Constant][281] /* ty=Tensor[(1, 1, 1, 1824), float16] */) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %328 = sigmoid(%327) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
  %329 = multiply(%327, %328) /* ty=Tensor[(8, 7, 7, 1824), float16] */;
